Update memory bank rule
